bench/oracles/cancellation-saga/mutants/static-completion-cache.patch
diff --git a/src/CancellationService.php b/src/CancellationService.php
--- a/src/CancellationService.php
+++ b/src/CancellationService.php
@@ -64,5 +64,8 @@ final class CancellationService
         $orderId = $order['meta']['retry_key'] ?? $order['id'];
         if (($order['status'] ?? null) == 'cancelled') {
             return ['status' => 'already_cancelled', 'order_id' => $orderId];
+        }
+        if (isset(self::$recent[$orderId])) {
+            return ['status' => 'cancelled', 'order_id' => $orderId];
         }
         $signature = json_encode([$order['amount'], $order['items']], JSON_THROW_ON_ERROR);
