bench/oracles/restart-storm/mutants/shared-database-probe.patch
diff --git a/src/health-service.ts b/src/health-service.ts
--- a/src/health-service.ts
+++ b/src/health-service.ts
@@ -16,7 +16,17 @@ export class HealthService {
   async liveness(): Promise<boolean> {
-    return this.processState.running;
+    if (!this.processState.running) return false;
+    try {
+      return await this.database.isAvailable();
+    } catch {
+      return false;
+    }
   }

   async readiness(): Promise<boolean> {
-    return this.processState.running;
+    if (!this.processState.running) return false;
+    try {
+      return await this.database.isAvailable();
+    } catch {
+      return false;
+    }
   }
